Revit 2027 API
RailingType.RailStructure Property
 The NonContinuousRailStructure.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NonContinuousRailStructure RailStructure { get; }
Public ReadOnly Property RailStructure As NonContinuousRailStructure
	Get
public:
property NonContinuousRailStructure^ RailStructure {
	NonContinuousRailStructure^ get ();
}
member RailStructure : NonContinuousRailStructure with get
Property Value
NonContinuousRailStructure
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace